fduignan/NucleoF042_SingleWS2812B/stm32f042.h
// Timer 16
#define TIM16_CR1	REGISTER_32(TIM16_BASE + 0)
#define TIM16_CR2	REGISTER_32(TIM16_BASE + 4)
#define TIM16_DIER	REGISTER_32(TIM16_BASE + 0x0c)
#define TIM16_SR	REGISTER_32(TIM16_BASE + 0x10)
#define TIM16_EGR	REGISTER_32(TIM16_BASE + 0x14)
#define TIM16_CCMR1	REGISTER_32(TIM16_BASE + 0x18)
#define TIM16_CCER	REGISTER_32(TIM16_BASE + 0x20)
#define TIM16_CNT	REGISTER_32(TIM16_BASE + 0x24)
#define TIM16_PSC	REGISTER_32(TIM16_BASE + 0x28)
#define TIM16_ARR	REGISTER_32(TIM16_BASE + 0x2c)
#define TIM16_RCR	REGISTER_32(TIM16_BASE + 0x30)
#define TIM16_CCR1	REGISTER_32(TIM16_BASE + 0x34)
#define TIM16_BDTR	REGISTER_32(TIM16_BASE + 0x44)
#define TIM16_DCR	REGISTER_32(TIM16_BASE + 0x48)
#define TIM16_DMAR	REGISTER_32(TIM16_BASE + 0x4c)


// Timer 15
#define TIM15_CR1	REGISTER_32(TIM15_BASE + 0)
#define TIM15_CR2	REGISTER_32(TIM15_BASE + 4)
#define TIM15_SMCR	REGISTER_32(TIM15_BASE + 8)
#define TIM15_DIER	REGISTER_32(TIM15_BASE + 0x0c)
#define TIM15_SR	REGISTER_32(TIM15_BASE + 0x10)
#define TIM15_EGR	REGISTER_32(TIM15_BASE + 0x14)
#define TIM15_CCMR1	REGISTER_32(TIM15_BASE + 0x18)
#define TIM15_CCER	REGISTER_32(TIM15_BASE + 0x20)
#define TIM15_CNT	REGISTER_32(TIM15_BASE + 0x24)
#define TIM15_PSC	REGISTER_32(TIM15_BASE + 0x28)
#define TIM15_ARR	REGISTER_32(TIM15_BASE + 0x2c)
#define TIM15_RCR	REGISTER_32(TIM15_BASE + 0x30)
#define TIM15_CCR1	REGISTER_32(TIM15_BASE + 0x34)
#define TIM15_CCR2	REGISTER_32(TIM15_BASE + 0x38)
#define TIM15_BDTR	REGISTER_32(TIM15_BASE + 0x44)
#define TIM15_DCR	REGISTER_32(TIM15_BASE + 0x48)
#define TIM15_DMAR	REGISTER_32(TIM15_BASE + 0x4c)


// USART1

#define USART1_CR1	REGISTER_32(USART1_BASE + 0)
#define USART1_CR2	REGISTER_32(USART1_BASE + 4)
#define USART1_CR3	REGISTER_32(USART1_BASE + 8)
#define USART1_BRR	REGISTER_32(USART1_BASE + 0x0c)
#define USART1_GTPR	REGISTER_32(USART1_BASE + 0x10)
#define USART1_RTOR	REGISTER_32(USART1_BASE + 0x14)
#define USART1_RQR	REGISTER_32(USART1_BASE + 0x18)
#define USART1_ISR	REGISTER_32(USART1_BASE + 0x1c)
#define USART1_ICR	REGISTER_32(USART1_BASE + 0x20)
#define USART1_RDR	REGISTER_32(USART1_BASE + 0x24)
#define USART1_TDR	REGISTER_32(USART1_BASE + 0x28)

// SPI1
#define SPI1_CR1	REGISTER_32(SPI1_BASE + 0)
#define SPI1_CR2	REGISTER_32(SPI1_BASE + 4)
#define SPI1_SR		REGISTER_32(SPI1_BASE + 8)
#define SPI1_DR		REGISTER_8(SPI1_BASE + 0x0c)
#define SPI1_CRCPR	REGISTER_32(SPI1_BASE + 0x10)
#define SPI1_RXCRCR	REGISTER_32(SPI1_BASE + 0x14)
#define SPI1_TXCRCR	REGISTER_32(SPI1_BASE + 0x18)


// Timer 1
#define TIM1_CR1	REGISTER_16(TIM1_BASE + 0)
#define TIM1_CR2	REGISTER_16(TIM1_BASE + 4)
#define TIM1_SMCR	REGISTER_16(TIM1_BASE + 8)
#define TIM1_DIER	REGISTER_16(TIM1_BASE + 0x0c)
#define TIM1_SR		REGISTER_16(TIM1_BASE + 0x10)
#define TIM1_EGR	REGISTER_16(TIM1_BASE + 0x14)
#define TIM1_CCMR1	REGISTER_16(TIM1_BASE + 0x18)
#define TIM1_CCMR2	REGISTER_16(TIM1_BASE + 0x1c)
#define TIM1_CCER	REGISTER_16(TIM1_BASE + 0x20)
#define TIM1_CNT	REGISTER_16(TIM1_BASE + 0x24)
#define TIM1_PSC	REGISTER_16(TIM1_BASE + 0x28)
#define TIM1_ARR	REGISTER_16(TIM1_BASE + 0x2c)
#define TIM1_RCR	REGISTER_16(TIM1_BASE + 0x30)
#define TIM1_CCR1	REGISTER_16(TIM1_BASE + 0x34)
#define TIM1_CCR2	REGISTER_16(TIM1_BASE + 0x38)
#define TIM1_CCR3	REGISTER_16(TIM1_BASE + 0x3c)
#define TIM1_CCR4	REGISTER_16(TIM1_BASE + 0x40)
#define TIM1_BDTR	REGISTER_16(TIM1_BASE + 0x44)
#define TIM1_DCR	REGISTER_16(TIM1_BASE + 0x48)
#define TIM1_DMAR	REGISTER_16(TIM1_BASE + 0x4c)

// ADC
#define ADC_ISR		REGISTER_32(ADC_BASE + 0)
#define ADC_IER		REGISTER_32(ADC_BASE + 4)
#define ADC_CR		REGISTER_32(ADC_BASE + 8)
#define ADC_CFGR1	REGISTER_32(ADC_BASE + 0x0c)
#define ADC_CFGR2	REGISTER_32(ADC_BASE + 0x10)
#define ADC_SMPR	REGISTER_32(ADC_BASE + 0x14)
#define ADC_TR		REGISTER_32(ADC_BASE + 0x20)
#define ADC_CHSELR	REGISTER_32(ADC_BASE + 0x28)
#define ADC_DR		REGISTER_32(ADC_BASE + 0x40)
#define ADC_CCR		REGISTER_32(ADC_BASE + 0x308)


// USART 8

#define USART8_CR1	REGISTER_32(USART8_BASE + 0)
#define USART8_CR2	REGISTER_32(USART8_BASE + 4)
#define USART8_CR3	REGISTER_32(USART8_BASE + 8)
#define USART8_BRR	REGISTER_32(USART8_BASE + 0x0c)
#define USART8_GTPR	REGISTER_32(USART8_BASE + 0x10)
#define USART8_RTOR	REGISTER_32(USART8_BASE + 0x14)
#define USART8_RQR	REGISTER_32(USART8_BASE + 0x18)
#define USART8_ISR	REGISTER_32(USART8_BASE + 0x1c)
#define USART8_ICR	REGISTER_32(USART8_BASE + 0x20)
#define USART8_RDR	REGISTER_32(USART8_BASE + 0x24)
#define USART8_TDR	REGISTER_32(USART8_BASE + 0x28)


// USART 7

#define USART7_CR1	REGISTER_32(USART7_BASE + 0)
#define USART7_CR2	REGISTER_32(USART7_BASE + 4)
#define USART7_CR3	REGISTER_32(USART7_BASE + 8)
#define USART7_BRR	REGISTER_32(USART7_BASE + 0x0c)
#define USART7_GTPR	REGISTER_32(USART7_BASE + 0x10)
#define USART7_RTOR	REGISTER_32(USART7_BASE + 0x14)
#define USART7_RQR	REGISTER_32(USART7_BASE + 0x18)
#define USART7_ISR	REGISTER_32(USART7_BASE + 0x1c)
#define USART7_ICR	REGISTER_32(USART7_BASE + 0x20)
#define USART7_RDR	REGISTER_32(USART7_BASE + 0x24)
#define USART7_TDR	REGISTER_32(USART7_BASE + 0x28)

// USART 6

#define USART6_CR1	REGISTER_32(USART6_BASE + 0)
#define USART6_CR2	REGISTER_32(USART6_BASE + 4)
#define USART6_CR3	REGISTER_32(USART6_BASE + 8)
#define USART6_BRR	REGISTER_32(USART6_BASE + 0x0c)
#define USART6_GTPR	REGISTER_32(USART6_BASE + 0x10)
#define USART6_RTOR	REGISTER_32(USART6_BASE + 0x14)
#define USART6_RQR	REGISTER_32(USART6_BASE + 0x18)
#define USART6_ISR	REGISTER_32(USART6_BASE + 0x1c)
#define USART6_ICR	REGISTER_32(USART6_BASE + 0x20)
#define USART6_RDR	REGISTER_32(USART6_BASE + 0x24)
#define USART6_TDR	REGISTER_32(USART6_BASE + 0x28)

// EXTI	
#define EXTI_IMR	REGISTER_32(EXTI_BASE + 0)
#define EXTI_EMR	REGISTER_32(EXTI_BASE + 4)
#define EXTI_RTSR	REGISTER_32(EXTI_BASE + 8)
#define EXTI_FTSR	REGISTER_32(EXTI_BASE + 0x0c)
#define EXTI_SWIER	REGISTER_32(EXTI_BASE + 0x10)
#define EXTI_PR		REGISTER_32(EXTI_BASE + 0x14)

// SYS Config
#define SYSCFG_CFGR1	REGISTER_32(SYSCFG_BASE + 0)
#define SYSCFG_EXTICR1	REGISTER_32(SYSCFG_BASE + 8)
#define SYSCFG_EXTICR2	REGISTER_32(SYSCFG_BASE + 0x0c)
#define SYSCFG_EXTICR3	REGISTER_32(SYSCFG_BASE + 0x10)
#define SYSCFG_EXTICR4	REGISTER_32(SYSCFG_BASE + 0x14)
#define SYSCFG_CFGR2	REGISTER_32(SYSCFG_BASE + 0x18)


// HDMI
#define CEC_CR		REGISTER_32(HDMI_BASE + 0)
#define CEC_CFGR	REGISTER_32(HDMI_BASE + 4)
#define CEC_TXDR	REGISTER_32(HDMI_BASE + 8)
#define CEC_RXDR	REGISTER_32(HDMI_BASE + 0x0c)
#define CEC_ISR		REGISTER_32(HDMI_BASE + 0x10)
#define CEC_IER		REGISTER_32(HDMI_BASE + 0x14)


// DAC
#define DAC_CR		REGISTER_32(DAC_BASE + 0)
#define DAC_SWTRIGR	REGISTER_32(DAC_BASE + 4)
#define DAC_DHR12R1	REGISTER_32(DAC_BASE + 8)
#define DAC_DHR12L1	REGISTER_32(DAC_BASE + 0x0c)
#define DAC_DHR8R1	REGISTER_32(DAC_BASE + 0x10)
#define DAC_DHR12R2	REGISTER_32(DAC_BASE + 0x14)
#define DAC_DHR12L2	REGISTER_32(DAC_BASE + 0x18)
#define DAC_DHR8R2	REGISTER_32(DAC_BASE + 0x1c)
#define DAC_DHR12RD	REGISTER_32(DAC_BASE + 0x20)
#define DAC_DHR12LD	REGISTER_32(DAC_BASE + 0x24)
#define DAC_DHR8RD	REGISTER_32(DAC_BASE + 0x28)
#define DAC_DOR1	REGISTER_32(DAC_BASE + 0x2c)
#define DAC_DOR2	REGISTER_32(DAC_BASE + 0x30)
#define DAC_SR		REGISTER_32(DAC_BASE + 0x34)

