fduignan/NucleoF042_SingleWS2812B/stm32f042.h
// PWR 
#define PWR_CR		REGISTER_32(PWR_BASE + 0)
#define PWR_CSR		REGISTER_32(PWR_BASE + 4)

// CRS
#define CRS_CR		REGISTER_32(CRS_BASE + 0)
#define CRS_CFGR	REGISTER_32(CRS_BASE + 4)
#define CRS_ISR		REGISTER_32(CRS_BASE + 8)
#define CRS_ICR		REGISTER_32(CRS_BASE + 0x0c)


// CAN
#define CAN_MCR		REGISTER_32(BXCAN_BASE + 0x000)
#define CAN_MSR		REGISTER_32(BXCAN_BASE + 0x004)
#define CAN_TSR		REGISTER_32(BXCAN_BASE + 0x008)
#define CAN_RF0R	REGISTER_32(BXCAN_BASE + 0x00c)
#define CAN_RF1R	REGISTER_32(BXCAN_BASE + 0x010)
#define CAN_IER		REGISTER_32(BXCAN_BASE + 0x014)
#define CAN_ESR		REGISTER_32(BXCAN_BASE + 0x018)
#define CAN_BTR		REGISTER_32(BXCAN_BASE + 0x01c)
#define CAN_TI0R	REGISTER_32(BXCAN_BASE + 0x180)
#define CAN_TDT0R	REGISTER_32(BXCAN_BASE + 0x184)
#define CAN_TDL0R	REGISTER_32(BXCAN_BASE + 0x188)
#define CAN_TDH0R	REGISTER_32(BXCAN_BASE + 0x18c)
#define CAN_TI1R	REGISTER_32(BXCAN_BASE + 0x190)
#define CAN_TDT1R	REGISTER_32(BXCAN_BASE + 0x194)
#define CAN_TDL1R	REGISTER_32(BXCAN_BASE + 0x198)
#define CAN_TDH1R	REGISTER_32(BXCAN_BASE + 0x19c)
#define CAN_TI2R	REGISTER_32(BXCAN_BASE + 0x1a0)
#define CAN_TDT2R	REGISTER_32(BXCAN_BASE + 0x1a4)
#define CAN_TDL2R	REGISTER_32(BXCAN_BASE + 0x1a8)
#define CAN_TDH2R	REGISTER_32(BXCAN_BASE + 0x1ac)
#define CAN_RI0R	REGISTER_32(BXCAN_BASE + 0x1b0)
#define CAN_RDT0R	REGISTER_32(BXCAN_BASE + 0x1b4)
#define CAN_RDL0R	REGISTER_32(BXCAN_BASE + 0x1b8)
#define CAN_RDH0R	REGISTER_32(BXCAN_BASE + 0x1bc)
#define CAN_RI1R	REGISTER_32(BXCAN_BASE + 0x1c0)
#define CAN_RDT1R	REGISTER_32(BXCAN_BASE + 0x1c4)
#define CAN_RDL1R	REGISTER_32(BXCAN_BASE + 0x1c8)
#define CAN_RDH1R	REGISTER_32(BXCAN_BASE + 0x1cc)
#define CAN_FMR		REGISTER_32(BXCAN_BASE + 0x200)
#define CAN_FM1R	REGISTER_32(BXCAN_BASE + 0x204)
#define CAN_FS1R	REGISTER_32(BXCAN_BASE + 0x20c)
#define CAN_FFA1R	REGISTER_32(BXCAN_BASE + 0x214)
#define CAN_FA1R	REGISTER_32(BXCAN_BASE + 0x21c)

#define CAN_F0R1	REGISTER_32(BXCAN_BASE + 0x240)
#define CAN_F0R2	REGISTER_32(BXCAN_BASE + 0x244)
#define CAN_F1R1	REGISTER_32(BXCAN_BASE + 0x248)
#define CAN_F1R2	REGISTER_32(BXCAN_BASE + 0x24c)
#define CAN_F2R1	REGISTER_32(BXCAN_BASE + 0x250)
#define CAN_F2R2	REGISTER_32(BXCAN_BASE + 0x254)
#define CAN_F3R1	REGISTER_32(BXCAN_BASE + 0x258)
#define CAN_F3R2	REGISTER_32(BXCAN_BASE + 0x25c)
#define CAN_F4R1	REGISTER_32(BXCAN_BASE + 0x260)
#define CAN_F4R2	REGISTER_32(BXCAN_BASE + 0x264)
#define CAN_F5R1	REGISTER_32(BXCAN_BASE + 0x268)
#define CAN_F5R2	REGISTER_32(BXCAN_BASE + 0x26c)
#define CAN_F6R1	REGISTER_32(BXCAN_BASE + 0x270)
#define CAN_F6R2	REGISTER_32(BXCAN_BASE + 0x274)
#define CAN_F7R1	REGISTER_32(BXCAN_BASE + 0x278)
#define CAN_F7R2	REGISTER_32(BXCAN_BASE + 0x27c)
#define CAN_F8R1	REGISTER_32(BXCAN_BASE + 0x280)
#define CAN_F8R2	REGISTER_32(BXCAN_BASE + 0x284)
#define CAN_F9R1	REGISTER_32(BXCAN_BASE + 0x288)
#define CAN_F9R2	REGISTER_32(BXCAN_BASE + 0x28c)
#define CAN_F10R1	REGISTER_32(BXCAN_BASE + 0x290)
#define CAN_F10R2	REGISTER_32(BXCAN_BASE + 0x294)
#define CAN_F11R1	REGISTER_32(BXCAN_BASE + 0x298)
#define CAN_F11R2	REGISTER_32(BXCAN_BASE + 0x29c)
#define CAN_F12R1	REGISTER_32(BXCAN_BASE + 0x2a0)
#define CAN_F12R2	REGISTER_32(BXCAN_BASE + 0x2a4)
#define CAN_F13R1	REGISTER_32(BXCAN_BASE + 0x2a8)
#define CAN_F13R2	REGISTER_32(BXCAN_BASE + 0x2ac)
#define CAN_F14R1	REGISTER_32(BXCAN_BASE + 0x2b0)
#define CAN_F14R2	REGISTER_32(BXCAN_BASE + 0x2b4)
#define CAN_F15R1	REGISTER_32(BXCAN_BASE + 0x2b8)
#define CAN_F15R2	REGISTER_32(BXCAN_BASE + 0x2bc)
#define CAN_F16R1	REGISTER_32(BXCAN_BASE + 0x2c0)
#define CAN_F16R2	REGISTER_32(BXCAN_BASE + 0x2c4)
#define CAN_F17R1	REGISTER_32(BXCAN_BASE + 0x2c8)
#define CAN_F17R2	REGISTER_32(BXCAN_BASE + 0x2cc)
#define CAN_F18R1	REGISTER_32(BXCAN_BASE + 0x2d0)
#define CAN_F18R2	REGISTER_32(BXCAN_BASE + 0x2d4)
#define CAN_F19R1	REGISTER_32(BXCAN_BASE + 0x2d8)
#define CAN_F19R2	REGISTER_32(BXCAN_BASE + 0x2dc)
#define CAN_F20R1	REGISTER_32(BXCAN_BASE + 0x2e0)
#define CAN_F20R2	REGISTER_32(BXCAN_BASE + 0x2e4)
#define CAN_F21R1	REGISTER_32(BXCAN_BASE + 0x2e8)
#define CAN_F21R2	REGISTER_32(BXCAN_BASE + 0x2ec)
#define CAN_F22R1	REGISTER_32(BXCAN_BASE + 0x2f0)
#define CAN_F22R2	REGISTER_32(BXCAN_BASE + 0x2f4)
#define CAN_F23R1	REGISTER_32(BXCAN_BASE + 0x2f8)
#define CAN_F23R2	REGISTER_32(BXCAN_BASE + 0x2fc)
#define CAN_F24R1	REGISTER_32(BXCAN_BASE + 0x300)
#define CAN_F24R2	REGISTER_32(BXCAN_BASE + 0x304)
#define CAN_F25R1	REGISTER_32(BXCAN_BASE + 0x308)
#define CAN_F25R2	REGISTER_32(BXCAN_BASE + 0x30c)
#define CAN_F26R1	REGISTER_32(BXCAN_BASE + 0x310)
#define CAN_F26R2	REGISTER_32(BXCAN_BASE + 0x314)
#define CAN_F27R1	REGISTER_32(BXCAN_BASE + 0x318)
#define CAN_F27R2	REGISTER_32(BXCAN_BASE + 0x31c)

// USB 
#define	USB_EP0R	REGISTER_32(USB_BASE + 0)
#define	USB_EP1R	REGISTER_32(USB_BASE + 4)
#define	USB_EP2R	REGISTER_32(USB_BASE + 8)
#define	USB_EP3R	REGISTER_32(USB_BASE + 0x0c)
#define	USB_EP4R	REGISTER_32(USB_BASE + 0x10)
#define	USB_EP5R	REGISTER_32(USB_BASE + 0x14)
#define	USB_EP6R	REGISTER_32(USB_BASE + 0x18)
#define	USB_EP7R	REGISTER_32(USB_BASE + 0x1c)
#define	USB_CNTR	REGISTER_32(USB_BASE + 0x40)
#define	USB_ISTR	REGISTER_32(USB_BASE + 0x44)
#define	USB_FNR		REGISTER_32(USB_BASE + 0x48)
#define	USB_DADDR	REGISTER_32(USB_BASE + 0x4c)
#define	USB_BTABLE	REGISTER_32(USB_BASE + 0x50)
#define	USB_LPMCSR	REGISTER_32(USB_BASE + 0x54)
#define	USB_BCDR	REGISTER_32(USB_BASE + 0x58)


// I2C2
#define I2C2_CR1	REGISTER_32(I2C2_BASE + 0)
#define I2C2_CR2	REGISTER_32(I2C2_BASE + 4)
#define I2C2_OAR1	REGISTER_32(I2C2_BASE + 8)
#define I2C2_OAR2	REGISTER_32(I2C2_BASE + 0x0c)
#define I2C2_TIMINGR	REGISTER_32(I2C2_BASE + 0x10)
#define I2C2_TIMEOUTR	REGISTER_32(I2C2_BASE + 0x14)
#define I2C2_ISR	REGISTER_32(I2C2_BASE + 0x18)
#define I2C2_ICR	REGISTER_32(I2C2_BASE + 0x1c)
#define I2C2_PECR	REGISTER_32(I2C2_BASE + 0x20)
#define I2C2_RXDR	REGISTER_8(I2C2_BASE + 0x24)
#define I2C2_TXDR	REGISTER_8(I2C2_BASE + 0x28)



// I2C1
#define I2C1_CR1	REGISTER_32(I2C1_BASE + 0)
#define I2C1_CR2	REGISTER_32(I2C1_BASE + 4)
#define I2C1_OAR1	REGISTER_32(I2C1_BASE + 8)
#define I2C1_OAR2	REGISTER_32(I2C1_BASE + 0x0c)
#define I2C1_TIMINGR	REGISTER_32(I2C1_BASE + 0x10)
#define I2C1_TIMEOUTR	REGISTER_32(I2C1_BASE + 0x14)
#define I2C1_ISR	REGISTER_32(I2C1_BASE + 0x18)
#define I2C1_ICR	REGISTER_32(I2C1_BASE + 0x1c)
#define I2C1_PECR	REGISTER_32(I2C1_BASE + 0x20)
#define I2C1_RXDR	REGISTER_8(I2C1_BASE + 0x24)
#define I2C1_TXDR	REGISTER_8(I2C1_BASE + 0x28)




// USART 5

#define USART5_CR1	REGISTER_32(USART5_BASE + 0)
#define USART5_CR2	REGISTER_32(USART5_BASE + 4)
#define USART5_CR3	REGISTER_32(USART5_BASE + 8)
#define USART5_BRR	REGISTER_32(USART5_BASE + 0x0c)
#define USART5_GTPR	REGISTER_32(USART5_BASE + 0x10)
#define USART5_RTOR	REGISTER_32(USART5_BASE + 0x14)
#define USART5_RQR	REGISTER_32(USART5_BASE + 0x18)
#define USART5_ISR	REGISTER_32(USART5_BASE + 0x1c)
#define USART5_ICR	REGISTER_32(USART5_BASE + 0x20)
#define USART5_RDR	REGISTER_32(USART5_BASE + 0x24)
#define USART5_TDR	REGISTER_32(USART5_BASE + 0x28)

// USART 4

