fduignan/NucleoF042_SingleWS2812B/stm32f042.h
#define USART4_CR1	REGISTER_32(USART4_BASE + 0)
#define USART4_CR2	REGISTER_32(USART4_BASE + 4)
#define USART4_CR3	REGISTER_32(USART4_BASE + 8)
#define USART4_BRR	REGISTER_32(USART4_BASE + 0x0c)
#define USART4_GTPR	REGISTER_32(USART4_BASE + 0x10)
#define USART4_RTOR	REGISTER_32(USART4_BASE + 0x14)
#define USART4_RQR	REGISTER_32(USART4_BASE + 0x18)
#define USART4_ISR	REGISTER_32(USART4_BASE + 0x1c)
#define USART4_ICR	REGISTER_32(USART4_BASE + 0x20)
#define USART4_RDR	REGISTER_32(USART4_BASE + 0x24)
#define USART4_TDR	REGISTER_32(USART4_BASE + 0x28)

// USART 3

#define USART3_CR1	REGISTER_32(USART3_BASE + 0)
#define USART3_CR2	REGISTER_32(USART3_BASE + 4)
#define USART3_CR3	REGISTER_32(USART3_BASE + 8)
#define USART3_BRR	REGISTER_32(USART3_BASE + 0x0c)
#define USART3_GTPR	REGISTER_32(USART3_BASE + 0x10)
#define USART3_RTOR	REGISTER_32(USART3_BASE + 0x14)
#define USART3_RQR	REGISTER_32(USART3_BASE + 0x18)
#define USART3_ISR	REGISTER_32(USART3_BASE + 0x1c)
#define USART3_ICR	REGISTER_32(USART3_BASE + 0x20)
#define USART3_RDR	REGISTER_32(USART3_BASE + 0x24)
#define USART3_TDR	REGISTER_32(USART3_BASE + 0x28)

// USART 2

#define USART2_CR1	REGISTER_32(USART2_BASE + 0)
#define USART2_CR2	REGISTER_32(USART2_BASE + 4)
#define USART2_CR3	REGISTER_32(USART2_BASE + 8)
#define USART2_BRR	REGISTER_32(USART2_BASE + 0x0c)
#define USART2_GTPR	REGISTER_32(USART2_BASE + 0x10)
#define USART2_RTOR	REGISTER_32(USART2_BASE + 0x14)
#define USART2_RQR	REGISTER_32(USART2_BASE + 0x18)
#define USART2_ISR	REGISTER_32(USART2_BASE + 0x1c)
#define USART2_ICR	REGISTER_32(USART2_BASE + 0x20)
#define USART2_RDR	REGISTER_32(USART2_BASE + 0x24)
#define USART2_TDR	REGISTER_32(USART2_BASE + 0x28)


// SPI2
#define SPI2_CR1	REGISTER_32(SPI2_BASE + 0)
#define SPI2_CR2	REGISTER_32(SPI2_BASE + 4)
#define SPI2_SR		REGISTER_32(SPI2_BASE + 8)
#define SPI2_DR		REGISTER_32(SPI2_BASE + 0x0c)
#define SPI2_CRCPR	REGISTER_32(SPI2_BASE + 0x10)
#define SPI2_RXCRCR	REGISTER_32(SPI2_BASE + 0x14)
#define SPI2_TXCRCR	REGISTER_32(SPI2_BASE + 0x18)


// RTC
#define RTC_TR		REGISTER_32(RTC_BASE + 0)
#define RTC_DR		REGISTER_32(RTC_BASE + 4)
#define RTC_CR		REGISTER_32(RTC_BASE + 8)
#define RTC_ISR		REGISTER_32(RTC_BASE + 0x0c)
#define RTC_PRER	REGISTER_32(RTC_BASE + 0x10)
#define RTC_WUTR	REGISTER_32(RTC_BASE + 0x14)
#define RTC_ALRMAR	REGISTER_32(RTC_BASE + 0x1c)
#define RTC_WPR		REGISTER_32(RTC_BASE + 0x24)
#define RTC_SSR		REGISTER_32(RTC_BASE + 0x28)
#define RTC_SHIFTR	REGISTER_32(RTC_BASE + 0x2c)
#define RTC_TSTR	REGISTER_32(RTC_BASE + 0x30)
#define RTC_TSDR	REGISTER_32(RTC_BASE + 0x34)
#define RTC_TSSSR	REGISTER_32(RTC_BASE + 0x38)
#define RTC_CALR	REGISTER_32(RTC_BASE + 0x3c)
#define RTC_TAFCR	REGISTER_32(RTC_BASE + 0x40)
#define RTC_ALRMASSR	REGISTER_32(RTC_BASE + 0x44)
#define RTC_BKP0R	REGISTER_32(RTC_BASE + 0x50)
#define RTC_BKP1R	REGISTER_32(RTC_BASE + 0x54)
#define RTC_BKP2R	REGISTER_32(RTC_BASE + 0x58)
#define RTC_BKP3R	REGISTER_32(RTC_BASE + 0x5c)
#define RTC_BKP4R	REGISTER_32(RTC_BASE + 0x60)

// Timer 14
#define TIM14_CR1	REGISTER_32(TIM14_BASE + 0)
#define TIM14_DIER	REGISTER_32(TIM14_BASE + 0x0c)
#define TIM14_SR	REGISTER_32(TIM14_BASE + 0x10)
#define TIM14_EGR	REGISTER_32(TIM14_BASE + 0x14)
#define TIM14_CCMR1	REGISTER_32(TIM14_BASE + 0x18)
#define TIM14_CCER	REGISTER_32(TIM14_BASE + 0x20)
#define TIM14_CNT	REGISTER_32(TIM14_BASE + 0x24)
#define TIM14_PSC	REGISTER_32(TIM14_BASE + 0x28)
#define TIM14_ARR	REGISTER_32(TIM14_BASE + 0x2c)
#define TIM14_CCR1	REGISTER_32(TIM14_BASE + 0x34)
#define TIM14_OR	REGISTER_32(TIM14_BASE + 0x50)

// Timer 7
#define TIM7_CR1	REGISTER_32(TIM7_BASE + 0)
#define TIM7_CR2	REGISTER_32(TIM7_BASE + 4)
#define TIM7_DIER	REGISTER_32(TIM7_BASE + 0x0c)
#define TIM7_SR		REGISTER_32(TIM7_BASE + 0x10)
#define TIM7_EGR	REGISTER_32(TIM7_BASE + 0x14)
#define TIM7_CNT	REGISTER_32(TIM7_BASE + 0x24)
#define TIM7_PSC	REGISTER_32(TIM7_BASE + 0x28)
#define TIM7_ARR	REGISTER_32(TIM7_BASE + 0x2c)

// Timer 6
#define TIM6_CR1	REGISTER_32(TIM6_BASE + 0)
#define TIM6_CR2	REGISTER_32(TIM6_BASE + 4)
#define TIM6_DIER	REGISTER_32(TIM6_BASE + 0x0c)
#define TIM6_SR		REGISTER_32(TIM6_BASE + 0x10)
#define TIM6_EGR	REGISTER_32(TIM6_BASE + 0x14)
#define TIM6_CNT	REGISTER_32(TIM6_BASE + 0x24)
#define TIM6_PSC	REGISTER_32(TIM6_BASE + 0x28)
#define TIM6_ARR	REGISTER_32(TIM6_BASE + 0x2c)

// Timer 3
#define TIM3_CR1	REGISTER_32(TIM3_BASE + 0)
#define TIM3_CR2	REGISTER_32(TIM3_BASE + 4)
#define TIM3_SMCR	REGISTER_32(TIM3_BASE + 8)
#define TIM3_DIER	REGISTER_32(TIM3_BASE + 0x0c)
#define TIM3_SR		REGISTER_32(TIM3_BASE + 0x10)
#define TIM3_EGR	REGISTER_32(TIM3_BASE + 0x14)
#define TIM3_CCMR1	REGISTER_32(TIM3_BASE + 0X18)
#define TIM3_CCMR2	REGISTER_32(TIM3_BASE + 0X1c)
#define TIM3_CCER	REGISTER_32(TIM3_BASE + 0X20)
#define TIM3_CNT	REGISTER_32(TIM3_BASE + 0X24)
#define TIM3_PSC	REGISTER_32(TIM3_BASE + 0X28)
#define TIM3_ARR	REGISTER_32(TIM3_BASE + 0X2c)
#define TIM3_CCR1	REGISTER_32(TIM3_BASE + 0X34)
#define TIM3_CCR2	REGISTER_32(TIM3_BASE + 0X38)
#define TIM3_CCR3	REGISTER_32(TIM3_BASE + 0X3c)
#define TIM3_CCR4	REGISTER_32(TIM3_BASE + 0X40)
#define TIM3_DCR	REGISTER_32(TIM3_BASE + 0X48)
#define TIM3_DMAR	REGISTER_32(TIM3_BASE + 0X4c)


// Timer 2
#define TIM2_CR1	REGISTER_32(TIM2_BASE + 0)
#define TIM2_CR2	REGISTER_32(TIM2_BASE + 4)
#define TIM2_SMCR	REGISTER_32(TIM2_BASE + 8)
#define TIM2_DIER	REGISTER_32(TIM2_BASE + 0x0c)
#define TIM2_SR		REGISTER_32(TIM2_BASE + 0x10)
#define TIM2_EGR	REGISTER_32(TIM2_BASE + 0x14)
#define TIM2_CCMR1	REGISTER_32(TIM2_BASE + 0X18)
#define TIM2_CCMR2	REGISTER_32(TIM2_BASE + 0X1c)
#define TIM2_CCER	REGISTER_32(TIM2_BASE + 0X20)
#define TIM2_CNT	REGISTER_32(TIM2_BASE + 0X24)
#define TIM2_PSC	REGISTER_32(TIM2_BASE + 0X28)
#define TIM2_ARR	REGISTER_32(TIM2_BASE + 0X2c)
#define TIM2_CCR1	REGISTER_32(TIM2_BASE + 0X34)
#define TIM2_CCR2	REGISTER_32(TIM2_BASE + 0X38)
#define TIM2_CCR3	REGISTER_32(TIM2_BASE + 0X3c)
#define TIM2_CCR4	REGISTER_32(TIM2_BASE + 0X40)
#define TIM2_DCR	REGISTER_32(TIM2_BASE + 0X48)
#define TIM2_DMAR	REGISTER_32(TIM2_BASE + 0X4c)


// Core peripherals
#define STK_BASE	0xe000e010
#define SCB_BASE	0xe000ed00
#define NVIC_BASE 	0xe000e100
// Seems base addresses are split for some core peripherals
#define SCB_BASE2	0xe000e008
#define NVIC_BASE2	0xe000ef00 
#define FLASH_SIZE	REGISTER_16( 0x1ffff7cc )

// Option bytes - see reference manual for details.

#define OPTION_WORD0	REGISTER_32( 0x1ffff800 )
#define OPTION_WORD1	REGISTER_32( 0x1ffff804 )
#define OPTION_WORD2	REGISTER_32( 0x1ffff808 )

// NVIC
#define ISER		REGISTER_32(NVIC_BASE + 0)
#define ICER		REGISTER_32(NVIC_BASE + 0x80)
#define ISPR		REGISTER_32(NVIC_BASE + 0x100)
#define ICPR		REGISTER_32(NVIC_BASE + 0x180)
#define IPR0		REGISTER_32(NVIC_BASE + 0x300)
#define IPR1		REGISTER_32(NVIC_BASE + 0x304)
#define IPR2		REGISTER_32(NVIC_BASE + 0x308)
#define IPR3		REGISTER_32(NVIC_BASE + 0x30c)
#define IPR4		REGISTER_32(NVIC_BASE + 0x310)
#define IPR5		REGISTER_32(NVIC_BASE + 0x314)
#define IPR6		REGISTER_32(NVIC_BASE + 0x318)
#define IPR7		REGISTER_32(NVIC_BASE + 0x31c)

// STK
#define STK_CSR		REGISTER_32(STK_BASE + 0)
#define STK_RVR		REGISTER_32(STK_BASE + 4)
#define STK_CVR		REGISTER_32(STK_BASE + 8)
#define STK_CALIB	REGISTER_32(STK_BASE + 0x0c)

// SCB
#define CPUID		REGISTER_32(SCB_BASE + 0)
#define ICSR		REGISTER_32(SCB_BASE + 4)
#define AIRCR		REGISTER_32(SCB_BASE + 0x0c)
#define SCR		REGISTER_32(SCB_BASE + 0x10)
#define CCR		REGISTER_32(SCB_BASE + 0x14)
#define SHPR2		REGISTER_32(SCB_BASE + 0x1c)
#define SHPR3		REGISTER_32(SCB_BASE + 0x20)
